SoCXin/HC32F005/src/template/common/hc32f005c6ua.h
typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3pu_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3pd_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3od_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3hie_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3lie_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3rie_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3fie_field_t;

typedef struct
{
    __IO uint32_t P00                       : 1;
    __IO uint32_t P01                       : 1;
    __IO uint32_t P02                       : 1;
    __IO uint32_t P03                       : 1;
} stc_gpio_p0stat_field_t;

typedef struct
{
    __IO uint32_t P00                       : 1;
    __IO uint32_t P01                       : 1;
    __IO uint32_t P02                       : 1;
    __IO uint32_t P03                       : 1;
} stc_gpio_p0iclr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t P14                       : 1;
    __IO uint32_t P15                       : 1;
} stc_gpio_p1stat_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t P14                       : 1;
    __IO uint32_t P15                       : 1;
} stc_gpio_p1iclr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 3;
    __IO uint32_t P23                       : 1;
    __IO uint32_t P24                       : 1;
    __IO uint32_t P25                       : 1;
    __IO uint32_t P26                       : 1;
    __IO uint32_t P27                       : 1;
} stc_gpio_p2stat_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 3;
    __IO uint32_t P23                       : 1;
    __IO uint32_t P24                       : 1;
    __IO uint32_t P25                       : 1;
    __IO uint32_t P26                       : 1;
    __IO uint32_t P27                       : 1;
} stc_gpio_p2iclr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3stat_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t P31                       : 1;
    __IO uint32_t P32                       : 1;
    __IO uint32_t P33                       : 1;
    __IO uint32_t P34                       : 1;
    __IO uint32_t P35                       : 1;
    __IO uint32_t P36                       : 1;
} stc_gpio_p3iclr_field_t;

typedef struct
{
    __IO uint32_t IESEL                     : 1;
} stc_gpio_ctrl0_field_t;

typedef struct
{
    __IO uint32_t EXT_CLK_SEL               : 4;
    __IO uint32_t SSN_SEL                   : 4;
    __IO uint32_t PCLK_SEL                  : 2;
    __IO uint32_t HCLK_SEL                  : 2;
    __IO uint32_t PCLK_EN                   : 1;
    __IO uint32_t HCLK_EN                   : 1;
    __IO uint32_t IR_POL                    : 1;
} stc_gpio_ctrl1_field_t;

typedef struct
{
    __IO uint32_t PCA_CAP0_SEL              : 2;
    __IO uint32_t PCA_CAP1_SEL              : 2;
    __IO uint32_t PCA_CAP2_SEL              : 2;
    __IO uint32_t PCA_CAP3_SEL              : 2;
    __IO uint32_t PCA_CAP4_SEL              : 2;
} stc_gpio_ctrl2_field_t;

typedef struct
{
    __IO uint32_t TM4_B_SEL                 : 2;
    __IO uint32_t TM5_B_SEL                 : 2;
    __IO uint32_t TM6_B_SEL                 : 2;
    __IO uint32_t TM4_A_SEL                 : 2;
    __IO uint32_t TM5_A_SEL                 : 2;
    __IO uint32_t TM6_A_SEL                 : 2;
} stc_gpio_ctrl3_field_t;

typedef struct
{
    __IO uint32_t TM0_GATE_SEL              : 2;
    __IO uint32_t TM1_GATE_SEL              : 2;
    __IO uint32_t TM2_GATE_SEL              : 2;
    __IO uint32_t TM3_GATE_SEL              : 2;
} stc_gpio_ctrl4_field_t;

typedef struct
{
    __IO uint32_t TME                       : 1;
} stc_i2c_tmrun_field_t;

typedef struct
{
    __IO uint32_t TM                        : 8;
} stc_i2c_tm_field_t;

typedef struct
{
    __IO uint32_t H1M                       : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t AA                        : 1;
    __IO uint32_t SI                        : 1;
    __IO uint32_t STO                       : 1;
    __IO uint32_t STA                       : 1;
    __IO uint32_t ENS                       : 1;
} stc_i2c_cr_field_t;

typedef struct
{
    __IO uint32_t I2CDAT                    : 8;
} stc_i2c_data_field_t;

typedef struct
{
    __IO uint32_t GC                        : 1;
    __IO uint32_t I2CADR                    : 7;
} stc_i2c_addr_field_t;

typedef struct
{
    __IO uint32_t I2CSTA                    : 8;
} stc_i2c_stat_field_t;

typedef struct
{
    __IO uint32_t LVDEN                     : 1;
    __IO uint32_t ACT                       : 1;
    __IO uint32_t SOURCE_SEL                : 2;
    __IO uint32_t VTDS                      : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FTEN                      : 1;
    __IO uint32_t RTEN                      : 1;
    __IO uint32_t HTEN                      : 1;
    __IO uint32_t IE                        : 1;
} stc_lvd_cr_field_t;

typedef struct
{
    __IO uint32_t INTF                      : 1;
} stc_lvd_ifr_field_t;

typedef struct
{
    __IO uint32_t CCF0                      : 1;
    __IO uint32_t CCF1                      : 1;
    __IO uint32_t CCF2                      : 1;
    __IO uint32_t CCF3                      : 1;
    __IO uint32_t CCF4                      : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t CR                        : 1;
    __IO uint32_t CF                        : 1;
} stc_pca_ccon_field_t;

typedef struct
{
    __IO uint32_t CFIE                      : 1;
    __IO uint32_t CPS                       : 3;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t WDTE                      : 1;
    __IO uint32_t CIDL                      : 1;
} stc_pca_cmod_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
} stc_pca_cnt_field_t;

typedef struct
{
    __IO uint32_t CCF0                      : 1;
    __IO uint32_t CCF1                      : 1;
    __IO uint32_t CCF2                      : 1;
    __IO uint32_t CCF3                      : 1;
    __IO uint32_t CCF4                      : 1;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t CF                        : 1;
} stc_pca_iclr_field_t;

typedef struct
{
    __IO uint32_t CCIE                      : 1;
    __IO uint32_t PWM                       : 1;
    __IO uint32_t TOG                       : 1;
    __IO uint32_t MAT                       : 1;
    __IO uint32_t CAPN                      : 1;
    __IO uint32_t CAPP                      : 1;
    __IO uint32_t ECOM                      : 1;
} stc_pca_ccapm0_field_t;

typedef struct
{
    __IO uint32_t CCIE                      : 1;
    __IO uint32_t PWM                       : 1;
    __IO uint32_t TOG                       : 1;
    __IO uint32_t MAT                       : 1;
    __IO uint32_t CAPN                      : 1;
    __IO uint32_t CAPP                      : 1;
    __IO uint32_t ECOM                      : 1;
} stc_pca_ccapm1_field_t;

typedef struct
{
    __IO uint32_t CCIE                      : 1;
    __IO uint32_t PWM                       : 1;
    __IO uint32_t TOG                       : 1;
    __IO uint32_t MAT                       : 1;
    __IO uint32_t CAPN                      : 1;
    __IO uint32_t CAPP                      : 1;
    __IO uint32_t ECOM                      : 1;
} stc_pca_ccapm2_field_t;

typedef struct
{
    __IO uint32_t CCIE                      : 1;
    __IO uint32_t PWM                       : 1;
    __IO uint32_t TOG                       : 1;
    __IO uint32_t MAT                       : 1;
    __IO uint32_t CAPN                      : 1;
    __IO uint32_t CAPP                      : 1;
    __IO uint32_t ECOM                      : 1;
} stc_pca_ccapm3_field_t;

typedef struct
{
    __IO uint32_t CCIE                      : 1;
    __IO uint32_t PWM                       : 1;
    __IO uint32_t TOG                       : 1;
    __IO uint32_t MAT                       : 1;
    __IO uint32_t CAPN                      : 1;
    __IO uint32_t CAPP                      : 1;
    __IO uint32_t ECOM                      : 1;
} stc_pca_ccapm4_field_t;

typedef struct
{
    __IO uint32_t CCAP0                     : 8;
} stc_pca_ccap0h_field_t;

typedef struct
{
    __IO uint32_t CCAP0                     : 8;
} stc_pca_ccap0l_field_t;

typedef struct
{
    __IO uint32_t CCAP1                     : 8;
} stc_pca_ccap1h_field_t;

typedef struct
{
    __IO uint32_t CCAP1                     : 8;
} stc_pca_ccap1l_field_t;

typedef struct
{
    __IO uint32_t CCAP2                     : 8;
} stc_pca_ccap2h_field_t;

typedef struct
{
    __IO uint32_t CCAP2                     : 8;
} stc_pca_ccap2l_field_t;

typedef struct
{
    __IO uint32_t CCAP3                     : 8;
} stc_pca_ccap3h_field_t;

typedef struct
{
    __IO uint32_t CCAP3                     : 8;
} stc_pca_ccap3l_field_t;

typedef struct
{
    __IO uint32_t CCAP4                     : 8;
} stc_pca_ccap4h_field_t;

typedef struct
{
    __IO uint32_t CCAP4                     : 8;
} stc_pca_ccap4l_field_t;

typedef struct
{
    __IO uint32_t CCAPO0                    : 1;
    __IO uint32_t CCAPO1                    : 1;
    __IO uint32_t CCAPO2                    : 1;
    __IO uint32_t CCAPO3                    : 1;
    __IO uint32_t CCAPO4                    : 1;
} stc_pca_ccapo_field_t;

typedef struct
{
    __IO uint32_t CCAP0                     :16;
} stc_pca_ccap0_field_t;

typedef struct
{
    __IO uint32_t CCAP1                     :16;
} stc_pca_ccap1_field_t;

typedef struct
{
    __IO uint32_t CCAP2                     :16;
} stc_pca_ccap2_field_t;

typedef struct
{
    __IO uint32_t CCAP3                     :16;
} stc_pca_ccap3_field_t;

typedef struct
{
    __IO uint32_t CCAP4                     :16;
} stc_pca_ccap4_field_t;

typedef struct
{
    __IO uint32_t CHKEN                     : 1;
    __IO uint32_t IE                        : 1;
} stc_ram_cr_field_t;

typedef struct
{
    __IO uint32_t ERRADDR                   :12;
} stc_ram_erraddr_field_t;

typedef struct
{
    __IO uint32_t ERR                       : 1;
} stc_ram_ifr_field_t;

typedef struct
{
    __IO uint32_t ERRCLR                    : 1;
} stc_ram_iclr_field_t;

typedef struct
{
    __IO uint32_t POR5V                     : 1;
    __IO uint32_t POR15V                    : 1;
    __IO uint32_t LVD                       : 1;
    __IO uint32_t WDT                       : 1;
    __IO uint32_t PCA                       : 1;
    __IO uint32_t LOCKUP                    : 1;
    __IO uint32_t SYSREQ                    : 1;
    __IO uint32_t RSTB                      : 1;
} stc_reset_flag_field_t;

typedef struct
{
    __IO uint32_t UART0                     : 1;
    __IO uint32_t UART1                     : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t I2C                       : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t SPI                       : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BASETIM                   : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t ADVTIM                    : 1;
    uint32_t RESERVED11                     : 3;
    __IO uint32_t PCA                       : 1;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t ADC                       : 1;
    __IO uint32_t VC                        : 1;
    uint32_t RESERVED18                     : 3;
    __IO uint32_t TRIM                      : 1;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t TICK                      : 1;
    uint32_t RESERVED25                     : 1;
    __IO uint32_t CRC                       : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t GPIO                      : 1;
} stc_reset_prei_field_t;

typedef struct
{
    __IO uint32_t SPR0                      : 1;
    __IO uint32_t SPR1                      : 1;
    __IO uint32_t CPHA                      : 1;
    __IO uint32_t CPOL                      : 1;
    __IO uint32_t MSTR                      : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t SPEN                      : 1;
    __IO uint32_t SPR2                      : 1;
} stc_spi_cr_field_t;

typedef struct
{
    __IO uint32_t SSN                       : 1;
} stc_spi_ssn_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t MDF                       : 1;
    __IO uint32_t SSERR                     : 1;
    __IO uint32_t WCOL                      : 1;
    __IO uint32_t SPIF                      : 1;
} stc_spi_stat_field_t;

typedef struct
{
    __IO uint32_t SPDAT                     : 8;
} stc_spi_data_field_t;

typedef struct
{
    __IO uint32_t SBUF                      : 8;
} stc_uart_sbuf_field_t;

typedef struct
{
    __IO uint32_t RIEN                      : 1;
    __IO uint32_t TIEN                      : 1;
    __IO uint32_t RB8                       : 1;
    __IO uint32_t TB8                       : 1;
    __IO uint32_t REN                       : 1;
    __IO uint32_t SM2                       : 1;
    __IO uint32_t SM01                      : 2;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t DBAUD                     : 1;
} stc_uart_scon_field_t;

typedef struct
{
    __IO uint32_t SADDR                     : 8;
} stc_uart_saddr_field_t;

typedef struct
{
    __IO uint32_t SADEN                     : 8;
} stc_uart_saden_field_t;

typedef struct
{
    __IO uint32_t RI                        : 1;
    __IO uint32_t TI                        : 1;
    __IO uint32_t FE                        : 1;
    __IO uint32_t TE                        : 1;
} stc_uart_isr_field_t;

typedef struct
{
    __IO uint32_t RICLR                     : 1;
    __IO uint32_t TICLR                     : 1;
    __IO uint32_t FECLR                     : 1;
} stc_uart_icr_field_t;

typedef struct
{
    __IO uint32_t DIV                       : 6;
    __IO uint32_t DIV_EN                    : 1;
    __IO uint32_t REF2P5_SEL                : 1;
    __IO uint32_t VC0_BIAS_SEL              : 2;
    __IO uint32_t VC0_HYS_SEL               : 2;
    __IO uint32_t VC1_BIAS_SEL              : 2;
    __IO uint32_t VC1_HYS_SEL               : 2;
} stc_vc_cr_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t P_SEL                     : 3;
    __IO uint32_t N_SEL                     : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
} stc_vc_vc0_cr_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    __IO uint32_t P_SEL                     : 3;
    __IO uint32_t N_SEL                     : 4;
    __IO uint32_t FLTEN                     : 1;
    __IO uint32_t DEBOUNCE_TIME             : 3;
    __IO uint32_t FALLING                   : 1;
    __IO uint32_t RISING                    : 1;
    __IO uint32_t LEVEL                     : 1;
    __IO uint32_t IE                        : 1;
} stc_vc_vc1_cr_field_t;

typedef struct
{
    __IO uint32_t INV_TIMER                 : 1;
    __IO uint32_t TIM0G                     : 1;
    __IO uint32_t TIM1G                     : 1;
    __IO uint32_t TIM2G                     : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t INV_PCA                   : 1;
    __IO uint32_t PCACAP0                   : 1;
    __IO uint32_t PCAECI                    : 1;
    __IO uint32_t INV_TIM4                  : 1;
    __IO uint32_t TIM4                      : 1;
    __IO uint32_t INV_TIM5                  : 1;
    __IO uint32_t TIM5                      : 1;
    __IO uint32_t INV_TIM6                  : 1;
    __IO uint32_t TIM6                      : 1;
    __IO uint32_t BRAKE                     : 1;
} stc_vc_vc0_out_cfg_field_t;

typedef struct
{
    __IO uint32_t INV_TIMER                 : 1;
    __IO uint32_t TIM0G                     : 1;
    __IO uint32_t TIM1G                     : 1;
    __IO uint32_t TIM2G                     : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t INV_PCA                   : 1;
    __IO uint32_t PCACAP0                   : 1;
    __IO uint32_t PCAECI                    : 1;
    __IO uint32_t INV_TIM4                  : 1;
    __IO uint32_t TIM4                      : 1;
    __IO uint32_t INV_TIM5                  : 1;
    __IO uint32_t TIM5                      : 1;
    __IO uint32_t INV_TIM6                  : 1;
    __IO uint32_t TIM6                      : 1;
    __IO uint32_t BRAKE                     : 1;
} stc_vc_vc1_out_cfg_field_t;

typedef struct
{
    __IO uint32_t VC0_INTF                  : 1;
    __IO uint32_t VC1_INTF                  : 1;
    __IO uint32_t VC0_FILTER                : 1;
    __IO uint32_t VC1_FILTER                : 1;
} stc_vc_ifr_field_t;

typedef struct
{
    __IO uint32_t WDTRST                    : 8;
} stc_wdt_rst_field_t;

typedef struct
{
    __IO uint32_t WOV                       : 4;
    __IO uint32_t WDTR                      : 1;
    __IO uint32_t WINT_EN                   : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t WDINT                     : 1;
    __IO uint32_t WCNTL                     : 8;
} stc_wdt_con_field_t;


typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_adc_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR2;
        stc_adc_cr2_field_t CR2_f;
    };
    uint8_t RESERVED3[32];
    union
    {
        __IO uint32_t RESULT0;
        stc_adc_result0_field_t RESULT0_f;
    };
    union
    {
        __IO uint32_t RESULT1;
        stc_adc_result1_field_t RESULT1_f;
    };
    union
    {
        __IO uint32_t RESULT2;
        stc_adc_result2_field_t RESULT2_f;
    };
    union
    {
        __IO uint32_t RESULT3;
        stc_adc_result3_field_t RESULT3_f;
    };
    union
    {
        __IO uint32_t RESULT4;
        stc_adc_result4_field_t RESULT4_f;
    };
    union
    {
        __IO uint32_t RESULT5;
        stc_adc_result5_field_t RESULT5_f;
    };
    union
    {
        __IO uint32_t RESULT6;
        stc_adc_result6_field_t RESULT6_f;
    };
    union
    {
        __IO uint32_t RESULT7;
        stc_adc_result7_field_t RESULT7_f;
    };
    union
    {
        __IO uint32_t RESULT8;
        stc_adc_result8_field_t RESULT8_f;
    };
    union
    {
        __IO uint32_t RESULT_ACC;
        stc_adc_result_acc_field_t RESULT_ACC_f;
    };
    union
    {
        __IO uint32_t HT;
        stc_adc_ht_field_t HT_f;
    };
    union
    {
        __IO uint32_t LT;
        stc_adc_lt_field_t LT_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_adc_ifr_field_t IFR_f;
    };
    union
    {
        __IO uint32_t ICLR;
        stc_adc_iclr_field_t ICLR_f;
    };
    union
    {
        __IO uint32_t RESULT;
        stc_adc_result_field_t RESULT_f;
    };
}M0P_ADC_TypeDef;

